*----------------------------------------------------------------*
* MAPSET SYKMAP1 ／ MAP SYKM01                                     *
* 受注番号入力画面処理(SYK008)の疑似会話で使用するマップ。         *
* フィールド: ORDNO(受注番号入力)、MSG(メッセージ表示)             *
*----------------------------------------------------------------*

SYKMAP1  DFHMSD TYPE=&SYSPARM,                                         X
               MODE=INOUT,                                             X
               LANG=COBOL,                                             X
               STORAGE=AUTO,                                           X
               TIOAPFX=YES

SYKM01   DFHMDI SIZE=(24,80)

ORDNO    DFHMDF POS=(3,10),                                            X
               LENGTH=8,                                               X
               ATTRB=(UNPROT,NUM)

MSG      DFHMDF POS=(22,5),                                            X
               LENGTH=40,                                              X
               ATTRB=(PROT,BRT)

         DFHMSD TYPE=FINAL
         END
