000100* DFHAID   CICS が提供する AID バイトの値
000200 01  DFHAID.
000300     02  DFHNULL             PIC X VALUE ' '.
000400     02  DFHENTER            PIC X VALUE ''''.
000500     02  DFHCLEAR            PIC X VALUE '_'.
000600     02  DFHPF1              PIC X VALUE '1'.
000700     02  DFHPF2              PIC X VALUE '2'.
000800     02  DFHPF3              PIC X VALUE '3'.
000900     02  DFHPF4              PIC X VALUE '4'.
001000     02  DFHPF5              PIC X VALUE '5'.
001100     02  DFHPF6              PIC X VALUE '6'.
001200     02  DFHPF7              PIC X VALUE '7'.
001300     02  DFHPF8              PIC X VALUE '8'.
001400     02  DFHPF9              PIC X VALUE '9'.
001500     02  DFHPF10             PIC X VALUE ':'.
001600     02  DFHPF11             PIC X VALUE '#'.
001700     02  DFHPF12             PIC X VALUE '@'.
