000100* DFHBMSCA CICS が提供する BMS 属性バイトの値
000200 01  DFHBMSCA.
000300     02  DFHBMPEM            PIC X VALUE ' '.
000400     02  DFHBMPNL            PIC X VALUE ' '.
000500     02  DFHBMASK            PIC X VALUE '0'.
000600     02  DFHBMUNP            PIC X VALUE ' '.
000700     02  DFHBMUNN            PIC X VALUE '&'.
000800     02  DFHBMPRO            PIC X VALUE '-'.
000900     02  DFHBMBRY            PIC X VALUE 'H'.
001000     02  DFHBMDAR            PIC X VALUE '<'.
001100     02  DFHBMFSE            PIC X VALUE 'A'.
001200     02  DFHBMPRF            PIC X VALUE '/'.
001300     02  DFHBMASF            PIC X VALUE '1'.
001400     02  DFHBMASB            PIC X VALUE '8'.
