000100* FLM010  シンボリックマップ（マップセット FLM010 の生成物）
000200* FLM01  契約番号入力、FLM02  契約明細
000300* 明細 11 行目を足したあと、マップを生成し直していない
000400*----------------------------------------------------------------*
000500 01  FLM01I.
000600     02  FILLER PIC X(12).
000700     02  KEIYNOL COMP PIC S9(4).
000800     02  KEIYNOF PICTURE X.
000900     02  FILLER REDEFINES KEIYNOF.
001000       03  KEIYNOA PICTURE X.
001100     02  KEIYNOI PIC X(10).
001200     02  MSGL COMP PIC S9(4).
001300     02  MSGF PICTURE X.
001400     02  FILLER REDEFINES MSGF.
001500       03  MSGA PICTURE X.
001600     02  MSGI PIC X(60).
001700 01  FLM01O REDEFINES FLM01I.
001800     02  FILLER PIC X(12).
001900     02  FILLER PICTURE X(3).
002000     02  KEIYNOO PIC X(10).
002100     02  FILLER PICTURE X(3).
002200     02  MSGO PIC X(60).
002300*----------------------------------------------------------------*
002400 01  FLM02I.
002500     02  FILLER PIC X(12).
002600     02  KEIYNO2L COMP PIC S9(4).
002700     02  KEIYNO2F PICTURE X.
002800     02  FILLER REDEFINES KEIYNO2F.
002900       03  KEIYNO2A PICTURE X.
003000     02  KEIYNO2I PIC X(10).
003100     02  KOKYAKUL COMP PIC S9(4).
003200     02  KOKYAKUF PICTURE X.
003300     02  FILLER REDEFINES KOKYAKUF.
003400       03  KOKYAKUA PICTURE X.
003500     02  KOKYAKUI PIC X(30).
003600     02  ZANDAKAL COMP PIC S9(4).
003700     02  ZANDAKAF PICTURE X.
003800     02  FILLER REDEFINES ZANDAKAF.
003900       03  ZANDAKAA PICTURE X.
004000     02  ZANDAKAI PIC X(12).
004100     02  MEI01L COMP PIC S9(4).
004200     02  MEI01F PICTURE X.
004300     02  FILLER REDEFINES MEI01F.
004400       03  MEI01A PICTURE X.
004500     02  MEI01I PIC X(70).
004600     02  MEI02L COMP PIC S9(4).
004700     02  MEI02F PICTURE X.
004800     02  FILLER REDEFINES MEI02F.
004900       03  MEI02A PICTURE X.
005000     02  MEI02I PIC X(70).
005100     02  MEI03L COMP PIC S9(4).
005200     02  MEI03F PICTURE X.
005300     02  FILLER REDEFINES MEI03F.
005400       03  MEI03A PICTURE X.
005500     02  MEI03I PIC X(70).
005600     02  MEI04L COMP PIC S9(4).
005700     02  MEI04F PICTURE X.
005800     02  FILLER REDEFINES MEI04F.
005900       03  MEI04A PICTURE X.
006000     02  MEI04I PIC X(70).
006100     02  MEI05L COMP PIC S9(4).
006200     02  MEI05F PICTURE X.
006300     02  FILLER REDEFINES MEI05F.
006400       03  MEI05A PICTURE X.
006500     02  MEI05I PIC X(70).
006600     02  MEI06L COMP PIC S9(4).
006700     02  MEI06F PICTURE X.
006800     02  FILLER REDEFINES MEI06F.
006900       03  MEI06A PICTURE X.
007000     02  MEI06I PIC X(70).
007100     02  MEI07L COMP PIC S9(4).
007200     02  MEI07F PICTURE X.
007300     02  FILLER REDEFINES MEI07F.
007400       03  MEI07A PICTURE X.
007500     02  MEI07I PIC X(70).
007600     02  MEI08L COMP PIC S9(4).
007700     02  MEI08F PICTURE X.
007800     02  FILLER REDEFINES MEI08F.
007900       03  MEI08A PICTURE X.
008000     02  MEI08I PIC X(70).
008100     02  MEI09L COMP PIC S9(4).
008200     02  MEI09F PICTURE X.
008300     02  FILLER REDEFINES MEI09F.
008400       03  MEI09A PICTURE X.
008500     02  MEI09I PIC X(70).
008600     02  MEI10L COMP PIC S9(4).
008700     02  MEI10F PICTURE X.
008800     02  FILLER REDEFINES MEI10F.
008900       03  MEI10A PICTURE X.
009000     02  MEI10I PIC X(70).
009100     02  MEI11L COMP PIC S9(4).                                   CHG24011
009200     02  MEI11F PICTURE X.                                        CHG24011
009300     02  FILLER REDEFINES MEI11F.                                 CHG24011
009400       03  MEI11A PICTURE X.                                      CHG24011
009500     02  MEI11I PIC X(70).                                        CHG24011
009600     02  MSG2L COMP PIC S9(4).
009700     02  MSG2F PICTURE X.
009800     02  FILLER REDEFINES MSG2F.
009900       03  MSG2A PICTURE X.
010000     02  MSG2I PIC X(60).
010100*----------------------------------------------------------------*
010200 01  FLM02O REDEFINES FLM02I.
010300     02  FILLER PIC X(12).
010400     02  FILLER PICTURE X(3).
010500     02  KEIYNO2O PIC X(10).
010600     02  FILLER PICTURE X(3).
010700     02  KOKYAKUO PIC X(30).
010800     02  FILLER PICTURE X(3).
010900     02  ZANDAKAO PIC ZZZ,ZZZ,ZZ9-.
011000     02  FILLER PICTURE X(3).
011100     02  MEI01O PIC X(70).
011200     02  FILLER PICTURE X(3).
011300     02  MEI02O PIC X(70).
011400     02  FILLER PICTURE X(3).
011500     02  MEI03O PIC X(70).
011600     02  FILLER PICTURE X(3).
011700     02  MEI04O PIC X(70).
011800     02  FILLER PICTURE X(3).
011900     02  MEI05O PIC X(70).
012000     02  FILLER PICTURE X(3).
012100     02  MEI06O PIC X(70).
012200     02  FILLER PICTURE X(3).
012300     02  MEI07O PIC X(70).
012400     02  FILLER PICTURE X(3).
012500     02  MEI08O PIC X(70).
012600     02  FILLER PICTURE X(3).
012700     02  MEI09O PIC X(70).
012800     02  FILLER PICTURE X(3).
012900     02  MEI10O PIC X(70).
013000     02  FILLER PICTURE X(3).
013100     02  MEI11O PIC X(70).                                        CHG24011
013200     02  FILLER PICTURE X(3).
013300     02  MSG2O PIC X(60).
