//*-------------------------------------------------------------*
//*  CI302 : INCLUDE member, SET statements only. Brought into   *
//*          the job stream at job level via INCLUDE MEMBER=     *
//*          CI302, ahead of the steps that use ENV and RUNID.   *
//*-------------------------------------------------------------*
//         SET ENV=PROD,RUNID=CJ308
