      * DFHBMSCA CICSが提供するBMS属性バイトの値
       01  DFHBMSCA.
           02  DFHBMPEM            PIC X VALUE ' '.
           02  DFHBMPNL            PIC X VALUE ' '.
           02  DFHBMASK            PIC X VALUE '0'.
           02  DFHBMUNP            PIC X VALUE ' '.
           02  DFHBMUNN            PIC X VALUE '&'.
           02  DFHBMPRO            PIC X VALUE '-'.
           02  DFHBMBRY            PIC X VALUE 'H'.
           02  DFHBMDAR            PIC X VALUE '<'.
           02  DFHBMFSE            PIC X VALUE 'A'.
           02  DFHBMPRF            PIC X VALUE '/'.
           02  DFHBMASF            PIC X VALUE '1'.
           02  DFHBMASB            PIC X VALUE '8'.
